app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("name", "price", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "6yu7uj"], ["price", 632], ["description", "gkjvc j cj"], ["created_at", "2016-12-19 12:11:46.803163"], ["updated_at", "2016-12-19 12:11:46.803163"]]